/**
 *
 * IL2036 main app initialization
 *  
 */
var app = angular.module("IL2036", []);


app.controller("mainAppController", ["$scope", "$http", "$rootScope", function($scope, $http, $rootScope){
	
	$scope.years = {good:[
		
		{
			year:2036,
			title:"",
			long_rows:[
			
				{
					total_weight:1,
					boxes:[
						
						{
							
							weight:1,
							type:"paragraph",
							body:"<h3>ישראל לא רק הצפופה ביותר מבין מדינות המערב, אלא גם מדינה עם שוק עבודה בעייתי ביותר. משקלם של הציבור החרדי והערבי עלה מאוד בשנים האחרונות וביחד הם מהווים כעת 40% מהאוכלוסייה. חלקם בשוק העבודה אמנם גדל בשנים האחרונות, אך הוא עדיין נמוך ביחס לאחרים. התוצאה:<b class='inline' >פחות עובדים במשק.</b></h3>",
							date:"21 יוני",
							category:"דמוגרפיה",
						}
					]
					
				},
				{
					total_weight:4,
					
					boxes:[
				{type:"paragraph", weight:2, category:"אבטלה", date:"13 ביוני", title:'<h4><b>כל עובד בישראל מפרנס מכספי המסים שלו</b><b>מישהו אחר שאיננו עובד</b></h4>', 
				body:"<p>חלקה היחסי של שכבת הגיל העובדת הלך והתכווץ, ועומד על כמעט מחצית ממה שהיה ב-2015. אפשר לראות בישראל יותר ויותר מבוגרים, יותר ויותר קשישים. או במלים אחרות, הנטל על מעמד הביניים העובד הפך להיות גדול יותר.  בגלל שבישראל יש גם הרבה ילדים, שגם הם אינם עובדים, יוצא שכל עובד בישראל מפרנס מכספי המסים שלו מישהו שאינו עובד. פעם, הנטל הזה היה מתחלק בין כתפיים רבות יותר</p>"},
						{type:"paragraph", weight:2, 
						title:"<h4><b>הממשלה נאלצת להעלות את המס בגלל הירידה בהכנסותיה ממס הכנסה.</b><b>הגירעון והיחס בין החובות לתוצר מזנקים</b></h4>", 
						body:"<p>מכיוון שכמעט חצי מהעובדים במשק עובדים בשכר נמוך מאוד, למדינה אין מספיק הכנסות ממס הכנסה והיא מעלה את שיעור המע״מ לרמה היסטורית של 20%, מה שמדכא את הצריכה ומקטין עוד יותר את הכנסות המדינה ממסים. בינתיים, הגירעון הממשלתי מאמיר ל-5% מהתוצר. במקביל, הממשלה לא מצליחה להקטין את חובותיה, והיחס בין החובות לבין התוצר מתחיל לעלות אחרי שנים של ירידה.התוצאה: נטל המס מעיק על מעמד הביניים יותר ויותר, נשארת להם פחות הכנסה פנויה ביד, אבל האיכות של השירותים הציבוריים שהם מקבלים מהממשלה מתדרדרים ולכן הם צריכים להוציא יותר כסף פרטי על שירותים פרטיים, וכך ההכנסה שלהם מתכווצת עוד יותר. </p>",category:"כספים", date:"5 ביוני",},
						
						
					]
				}
			],
			short_rows:[
				{
					total_weight:1,
					
					boxes:[
						
						{ 
							type:"paragraph", 
							weight:1,
							date:"21 יוני",
							category:"דמוגרפיה",
							src:"./img/2036-headline.png",
							title:"<h1>המדינה הצפופה ביותר בעולם המערבי</h1>"
						}
						
					]
					
				},
				
				{
					total_weight:5,
					
					boxes:[
				{type:"paragraph", weight:2, category:"אבטלה", date:"13 ביוני", title:"<h2>שיעור המע\"מ עולה לרמה היסטורית של 20%</h2>", body:""},
						{type:"paragraph", weight:2, title:"<h2>הנטל על מעמד הביניים כבד מאי פעם</h2>", body:"",category:"כספים", date:"5 ביוני",},
						
						
					]
				}
			]
		},
		{
			
			year:2029,
			title:"",
			short_rows:[
				
				{
					
					boxes:[
					
						{
							
							weight:1,
							type:"paragraph",
							title:"<h1>בשל הזדקנות האוכלוסייה: גל הפרישה יועלה</h1>",
							body:"<h2>יותר מ-20 שנה אחרי שמשרד האוצר המליץ על כך לראשונה: גיל הפרישה מועלה בבת אחת ל-69 גם לגברים וגם לנשים</h2>",
							category:"כלכלה", date:"21 ביוני",
						}
					]
				},
				{
					boxes:[
					
						{
							weight:2,
							type:"paragraph",
							title:"<h4>משרד לשיוויון חברתי - אאוט, המשרד לאזרחים ותיקים -אין</h4>"+
							'<div class="footer" ><ul><li>5 ביוני</li><li>כלכלה</li><li>שתף</li></ul></div>'
							+"<h4>הקופה של הביטוח הלאומי הולכת ומתרוקנת</h4>",
							category:"כלכלה", date:"13 ביוני",
						},
						{
							weight:2,
							type:"chart",
							chartType:"LineDonatChart",
							csv:"contryExpences.csv",
							
						}
					]
					
				}
				
			],
			long_rows:[
				
				{
					boxes:[
						
						{
							type:"paragraph",
							body:"<p>בשל הזדקנות האוכלוסייה הביטוח הלאומי מוציא כל שנה יותר מ-30 מיליארד שקל על קצבאות זקנה וקצבאות סיעוד לאוכלוסיה המבוגרת, והסכום הזה רק הולך וגדל, גם באופן מוחלט וגם ביחס לתוצר של המשק כולו. בשביל שהכסף של הביטוח הלאומי לא ייגמר מהר מדי, הממשלה העלתה את גיל הפרישה עד ל-69, גם לגברים וגם לנשים, יותר מ-20 שנה אחרי שמשרד האוצר המליץ לראשונה להעלות אותו. המחיר: העלאת גיל הפרישה נעשתה בבת אחת במקום באופן הדרגתי, ופגעה בעשרות אלפי עובדים שהיו רגע לפני פרישה.</p>",
							category:"כספים", date:"21 בספטמבר",
						}
					]
				
				},
				
				{
					boxes:[
						
						{
							weight:1,
							type:"paragraph",
							body:"<h5>חרף הצעדים שבהם נקטה הממשלה בשנים האחרונות, הרזרבות של הביטוח הלאומי אוזלות. צעדים אלה סייעו רק במעט, והכבידו על המעסיקים, ועל העובדים עצמם. במקביל, גם הקיצוץ בקצבאות לא ביטל את הבלתי נמנע אלא רק דחה אותו קצת.</h5>",
							category:"כספים", date:"5 ביוני",
						},
						
						{
							weight:1,
							type:"paragraph",
							body:"<h5>הממשלה משנה את שמו של המשרד לשוויון חברתי למשרד לאזרחים ותיקים ומטילה על השרה לגבש תוכנית אסטרטגית להתמודדות עם הזדקנות האוכלוסייה.</h5>",
							category:"דמוגרפיה", date:"13 ביוני",
						}
					]
					
				}
			]
		},
		
		{
			
			year:2024,
			short_rows:[
				{
					boxes:[
					
						{
							weight:1,
							type:"paragraph",
							title:"<h1>בתוך 15 שנה: מספר הקשישים בישראל הכפיל את עצמו</h1>",
						}
					]
				},
				{
					boxes:[
					
						{
							weight:1,
							type:"paragraph",
							title:"<h3>בתוך 15 שנה: מספר הקשישים בישראל הכפיל את עצמו</h3>",
							body:"<h5>״אנחנו מתגעגעים לימים שבהם הזקנה היתה רק במסדרון ולא במחסן, בחדרי השירותים ובחוץ, בשמש״</h5>"
						},
						
						{
							weight:1,
							type:"video",
							src:"img/2024-video-kendel.jpg",
						}
					]
				}
			],
			
			long_rows:[
				{
					boxes:[
						
						{
							weight:1,
							type:"paragraph",
							body:"<h5>חלקם של המבוגרים באוכלוסיה לא מפסיק לעלות וכבר קרוב ל-14%. אחרי עשרים שנה שבהן חלקם היחסי של המבוגרים נשאר אותו הדבר, מספרם של הקשישים באוכלוסיה הישראלית הכפיל את עצמו בחמש עשרה השנים האחרונות. </h5>"
							
						}
						
					]
				},
				{
					
					boxes:[
					
						{
							weight:2,
							type:"paragraph",
							body:"<h5>המערכות הציבוריות מתחילות לקרוס. בתי החולים והמחלקות הפנימיות כבר מזמן לא עומדים בעומס. הממשלה מוציאה לדרך תוכנית חירום לבניית שני בתי חולים חדשים ולהרחבת המחלקות הקיימות, אבל זה ייקח שנים. בינתיים, המחסור ברופאים ואחיות מחריף. התוכנית להוספת תקנים שהושקה לפני חמש שנים טרם נותנת אותותיה, משום שהכשרת רופא אורכת לפחות שבע שנים.</h5>"
							
						},
						{
							weight:2,
							type:"chart",
							chartType:"PopulationLineChart",
							csv:"populationGroth.csv",
							
						}
					]
				}
			]
		},
		
		{
			
			year:2019,
			short_rows:[
				{
					boxes:[
						
						{
							weight:1,
							type:"paragraph",
							title:"<h5>החרדים (בעיקר גברים) והערבים (בעיקר נשים) ממשיכים להצטרף לשוק העבודה, אולם בקצב נמוך יחסית. ובעיקר, נתוני הביטוח הלאומי מעידים כי העובדים שמצטרפים לשוק העבודה נכנסים אליו בשכר נמוך למדי, שעומד לרוב על מחצית מאשר שכרם של עובדים שאינם חרדים או ערבים.</h5>"
						},
						{
							weight:2,
							type:"paragraph",
							body:"<p>שר האוצר מכריז כי הדבר עלול להביא לכך שבעוד עשור לא יהיו מספיק מסים בקופת המדינה (כי עובדים בשכר נמוך משלמים פחות מסים, או לא משלמים כלל) ומנסה להשיק מחדש את התוכנית להכנסת לימודי הליבה אל תוך מערכת החינוך החרדי., במקביל הוא מקדם תוספות תקציב למגזר הערבי לטובת שיפור רמת ההשכלה ושיפור רמת התשתיות הציבוריות (מעונות יום לנשים, תחבורה ציבורית ועוד).<br/>בתגובה, חברי כנסת מהימין תוקפים אותו על כך שהוא בוגד ברוב היהודי במדינת ישראל ומפלה לטובה את המגזר הערבי, וחברי כנסת חרדים מאיימים במשבר קואליציוני ובפירוק הממשלה. בתוך שלושה ימים ראש הממשלה מורה לשר האוצר לגנוז את התוכניות ואף מבטל את תוכנית התקצוב הדיפרנציאלי למערכת החינוך הערבית שהתחילה חמש שנים קודם לכן.</p>"
						},
						{
							weight:2,
							type:"chart",
							chartType:"PopulationLineChart",
							csv:"populationGroth.csv"
						}
					]
					
				}
			]
		},
		{
			
			year:2016,
			short_rows:[
				{
					boxes:[
						
						{
							weight:1,
							type:"paragraph",
							title:"<h5>נגנזה התוכנית לתמרץ עובדים להישאר בשוק העבודה גם בגיל מבוגר ההמלצה של המועצה הלאומית לכלכלה מ-2013 לגבש תוכנית אסטרטגית להתמודדות עם הזדקנות האוכלוסייה נשארת על הנייר</h5>"
						},
						{
							weight:2,
							type:"paragraph",
							title:"<h5>התוכנית לשילוב חרדים וערבים בשוק העבודה מתנהלת בעצלתיים</h5>",
							body:"<p>התוכנית של משרד הכלכלה לעידוד כניסת חרדים וערבים לשוק העבודה מתקדמת בקצב איטי על בסיס תקציב בינוני, ובמקביל הממשלה מבטלת את החלטת הממשלה הקודמת ומחליטה שלא לחייב לימודי ליבה במערכת החינוך החרדית. במערכת החינוך הערבית נמשכת האפליה לרעה מבחינת תקציבים, על אף ניסיון מצומצם של הממשלה לחלק מחדש את התקציב כך שהתלמידים הערבים יקבלו יותר.</p>"
							,category:"כספים", date:"12 בינואר"
						},
						{
							weight:2,
							type:"chart",
							chartType:"SunChart",
							csv:'enployment.csv'
						}
					]
					
				}
			]
		}
	]};
	
	$scope.senario = "good";
	$scope.yearIndex = 0;
	
	$rootScope.setYearIndex = function(index){
		
		$scope.current_year = $scope.years[$scope.senario][index].year;
	};
	
	$rootScope.setYearIndex(0);
	
}]);
